{
	"id": 28,
	"title": "White Beans and Sausage",
	"imageURL": "http://www.simplyrecipes.com/wp-content/uploads/2007/09/white-beans-sausage-vertical.jpg",
	"remoteURL": "http://www.simplyrecipes.com/recipes/white_beans_and_sausage/",
	"servings": {
		"yield":6,
		"size":"one-sixth of recipe"
		},
	
	"nutrition": [
  {"id":"calories","amount":0},
  {"id":"carbohydrates","amount":0},
  {"id":"fat","amount":0},
  {"id":"protein","amount":0},
  {"id":"saturatedfat","amount":0},
  {"id":"sodium","amount":0},
  {"id":"fiber","amount":0},
  {"id":"sugars","amount":0},
  {"id":"cholesterol","amount":0},
  {"id":"potasssium","amount":0},
  {"id":"vitamina","amount":0},
  {"id":"vitaminc","amount":0},
  {"id":"calcium","amount":0},
  {"id":"iron","amount":0}
	],
 	"tags":["dinner"],
	"ingredients":[
		"1 lb dried cannellini beans",
		"2 Tbsp olive oil",
		"4-5 fresh sage leaves",
		"2 cloves garlic, crushed",
		"3 teaspoons kosher salt",
		"4 black peppercorns",
		"or 4 15-ounce cans cannellini beans",
		"5 Tbsp olive oil",
		"1 1/2 pounds sweet Italian sausage",
		"4 cloves garlic, peeled and crushed",
		"3-4 canned plum tomatoes, chopped",
		"Pinch red pepper flakes",
		"1 cup tomato purée",
		"Salt (about 2 teaspoons) and freshly ground black pepper"
	],
	"preparation": [
		"Preparing dry beans if using",
		"Rinse the dry beans under cold running water, removing any stones you may find. Place the beans in a large pot and cover with at least a couple of inches with cold water. Soak for at least 4 hours. (To do a quick soak, you can pour boiling water over the beans and cover by a couple of inches, and just soak for one hour instead of four.)",
		"Drain the beans. Return the beans to the pot and add 3 quarts of water to the pot. Add 2 Tbsp olive oil, the sage leaves, 2 cloves crushed garlic, 3 teaspoons kosher salt, and the peppercorns. Cover, bring to a simmer on medium heat, and simmer beans for one hour. Lower the heat so that the beans are barely simmering. Cook for an additional 1-2 hours, or until beans are just tender. Note that the fresher the beans the shorter the cooking time, the older the beans the longer the cooking time. Remove from heat and let cool in cooking liquid. Set aside 1/2 cup of the cooking liquid, drain the rest from the beans.",
		"Preparing canned beans if using",
		"Taste the liquid in the cans of beans. If it tastes good (and it should), drain the beans and reserve 1/2 a cup of the bean liquid. If the liquid doesn't taste good (which may happen if the can has been sitting around too long), discard the liquid and use 1/2 cup of water instead of the bean liquid in the next step.",
		"Preparing the beans and sausage",
		"Heat one tablespoon of olive oil in a large, heavy-bottomed skillet over medium heat. Remove sausages from their casings (if the sausage has come in casings), and fry on the skillet until lightly browned, about 3-4 minutes. Do not stir that much and do not crowd the pan, or the sausage won't brown well. Add the reserved bean cooking (or can) liquid, 4 Tbsp olive oil, garlic, chopped tomatoes, and red pepper flakes, stirring occasionally until slightly thickened, about 5 minutes.",
		"Add the reserved beans and tomato purée. Season to taste with salt and pepper. Simmer a few minutes longer, stirring gently, until sausage is cooked through and the sauce has thickened. Be careful not to break up the beans."
	],
	"note": "You can either cook the beans from scratch (we’re using a Tuscan approach found in Saveur Magazine), or use canned beans. By the way, you know how they always say to “rinse and drain” the beans if using canned beans? That’s only because if the cans have been on the shelf for a while they can sometimes absorb a metalic flavor from the can. But if your can of beans if freshly bought, this may not be the case, and there can be plenty of flavor in the bean soaking water. So, taste! If the bean water tastes good, use it. If not, don’t."
}