{
	"id": 3,
	"title": "Soft Tacos With Spicy Chicken /w carrots",
	"imageURL": "http://img2.timeinc.net/health/img/recipes/recipes/hl/sft-tacos-spicy-chkn-hl-1168095-x.jpg",
	"remoteURL": "http://www.health.com/health/recipe/0,,10000001168095,00.html",
	"servings": {
		"yield": 1,
		"size": "2 Tortillas"
	},
	"nutrition": [{
		"id": "calories","amount": 225}, {
		"id": "carbohydrates","amount": 30
	}, {
		"id": "fat","amount": 7
	}, {
		"id": "protein",		"amount": 11
	}, {
		"id": "saturatedfat",		"amount": 1
	}, {
		"id": "sodium",		"amount": 528
	}, {
		"id": "fiber",		"amount": 5
	}, {
		"id": "cholesterol",		"amount": 18
	}, {
		"id": "calcium",		"amount": 66
	}, {
		"id": "iron",		"amount": 1
	}],
	"tags": [
		"dinner"
	],
	"ingredients": [{
		"id": 56, "count": 1}, {
		"id": 66, "count": 0.125	}, {
		"id": 57, "count": 0.125	}, {
		"id": 72, "count": 0.5	}, {
		"id": 81, "count": 0.25	}, {
		"id": 104, "count": 0.5	}, {
		"id": 23, "count": 0.25	}, {
		"id": 105, "count": 0.25	}, {
		"id": 58, "count": 1	}, {
		"id": 106, "count": 0.25	}, {
		"id": 85, "count": 2	}, {
		"id": 47, "count": 1	}, {
		"id": 86, "count": 4
	}],
	"preparation": [
		"Preheat oven to 300 degrees.",
		"Seed and finely chop chipotle chiles.",
		"Finely chop the onion",
		"Season the chicken breast with salt and pepper. In a small bowl, combine the bay leaf, oregano, chipotle chiles (or another mildly hot fresh chile, seeded and finely chopped), onion, and vinegar. Allow to marinate for at least an hour or overnight.",
		"Heat olive oil in a large heavy skillet over medium-high heat. Sauté chicken for about 10 minutes, or until brown. Turn the chicken and cook for another 20 minutes or until tender and cooked through.",
		"Splash in 3/4 cup beeef broth, a little at a time. As the chicken cooks, add more broth as needed to keep chicken from drying out. Test for doneness by making an incision with a knife; no pinkness means the chicken is done. (Or test with a meat thermometer; internal temperature should be 170 degrees.) Remove chicken from skillet and allow to cool slightly.",
		"When the chicken is nearly done, wrap 6 tortillas at a time in aluminum foil. Place on a baking sheet and bake in a 300 degrees oven for about 5 minutes or until warm. Repeat with remaining tortillas. Line a basket with a napkin, and place warmed tortillas in basket.",
		"Deglaze the pan with remaining 1/4 cup of broth. Cook for 2 minutes. Pull the chicken into bite-size strips. Toss with the pan juices and scatter the chopped cilantro over the top."
	],
	"note": "add carrots to nutrition and ingredient lists also update nutrition to reflect broth sub for beer"
}