{
	"id": 27,
	"title": "Marinated Giant White Beans and Beets",
	"imageURL": "http://graphics8.nytimes.com/images/2010/02/24/science/24recipehealth_600q/24recipehealth_600q-articleLarge-v2.jpg",
	"remoteURL": "http://cooking.nytimes.com/recipes/1014066-marinated-giant-white-beans-and-beets",
	"servings": {
		"yield":6,
		"size":"one-sixth of recipe"
		},
	
	"nutrition": [
  {"id":"calories","amount":0},
  {"id":"carbohydrates","amount":0},
  {"id":"fat","amount":0},
  {"id":"protein","amount":0},
  {"id":"saturatedfat","amount":0},
  {"id":"sodium","amount":0},
  {"id":"fiber","amount":0},
  {"id":"sugars","amount":0},
  {"id":"cholesterol","amount":0},
  {"id":"potasssium","amount":0},
  {"id":"vitamina","amount":0},
  {"id":"vitaminc","amount":0},
  {"id":"calcium","amount":0},
  {"id":"iron","amount":0}
	],
 	"tags":["dinner"],
	"ingredients":[
		"FOR THE BEANS",
		"1 pound dried large lima beans",
		"1 large white onion, cut in half",
		"4 garlic cloves, crushed",
		"1 bay leaf",
		"Salt to taste",
		"¼ cup fresh lemon juice",
		"⅓ cup extra virgin olive oil",
		"½ cup finely chopped celery",
		"½ cup finely chopped yellow or red bell pepper",
		"½ cup finely chopped red onion, soaked for five minutes in cold water, drained and rinsed optional",
		"2 tablespoons chopped fresh dill",
		"FOR THE BEETS",
		"8 small beets, greens cut away, scrubbed",
		"⅓ cup red wine vinegar or sherry vinegar",
		"Salt to taste",
		"2 garlic cloves, cut in half",
		"½ teaspoon sugar"
	],
	"preparation": [
		"FOR THE BEANS",
		"Place the beans in a large pot. Cover by 2 inches with water, and bring to a gentle boil. Skim off any foam, and add the onion, garlic and bay leaf. Turn the heat to low, cover and simmer 30 minutes. Add salt to taste, and simmer an additional 20 minutes until just tender. Remove from the heat. Remove and discard the onion, garlic cloves and the bay leaf. Allow the beans to cool in the liquid, then drain through a strainer set over a bowl. Gently toss the beans in a bowl with the lemon juice, olive oil, celery, peppers, onion and herbs. If desired, add 2 to 4 tablespoons of the bean broth. Season to taste with salt and pepper. Set aside.",
		"Cook the beets while the beans are cooking. Place in a saucepan, cover with water, add 1/4 cup of the vinegar and salt to taste. Bring to a boil, reduce the heat and simmer until tender, 30 to 45 minutes, depending on the size of the beets. Remove from the heat, add the garlic to the pot and set aside to cool. Remove the beets from the pot (do not drain), slip off the skins and cut in wedges.",
		"Combine the remaining vinegar, the sugar and 1/4 cup of the beet broth (discard the garlic). Toss with the beets. Arrange the beans on a plate or in a bowl and surround with the beets. If you wish, serve this dish with skordalia."
	],
	"note": "Advance preparation: The beans and the beets can both be prepared up to three days before serving. Martha Rose Shulman can be reached at martha-rose-shulman.com. Very good served room temperature or slightly warm. Be warned: without pre-soaking, the giant limas came out with good texture and without falling apart, but they took 2-1/2 hours of simmering to become tender-- definitely a good idea to make them the day before. ///// Nutritional analysis per serving (6 servings) 221 calories; 12 grams fat; 1 gram saturated fat; 8 grams monounsaturated fat; 1 gram polyunsaturated fat; 21 grams carbohydrates; 4 grams dietary fiber; 3 grams sugars; 6 grams protein; 17 milligrams sodium"
}