{
	"id": 23,
	"title": "Charred Lemon Chicken Piccata",
	"imageURL": "http://cdn-image.myrecipes.com/sites/default/files/styles/300x300/public/charred-lemon-chicken-piccata-ck.jpg?itok=HC0D1R6q",
	"remoteURL": "http://www.myrecipes.com/recipe/charred-lemon-chicken-piccata",
	"servings": {
		"yield":4,
		"size":"1 chicken breast half and about 3 tablespoons sauce"
		},
	
	"nutrition": [
  {"id":"calories","amount":0},
  {"id":"carbohydrates","amount":0},
  {"id":"fat","amount":0},
  {"id":"protein","amount":0},
  {"id":"saturatedfat","amount":0},
  {"id":"sodium","amount":0},
  {"id":"fiber","amount":0},
  {"id":"sugars","amount":0},
  {"id":"cholesterol","amount":0},
  {"id":"potasssium","amount":0},
  {"id":"vitamina","amount":0},
  {"id":"vitaminc","amount":0},
  {"id":"calcium","amount":0},
  {"id":"iron","amount":0}
	],
 	"tags":["dinner"],
	"ingredients":[
		"2 small lemons, cut into thin rounds",
		"1 1/2 teaspoons sugar",
		"4 garlic cloves, halved",
		"4 (6-ounce) skinless, boneless chicken breast halves, pounded to 3/4-inch thickness",
		"1/2 teaspoon kosher salt, divided",
		"1/2 teaspoon freshly ground black pepper",
		"1 tablespoon olive oil, divided",
		"2 tablespoons unsalted butter, divided",
		"1 teaspoon grated shallot",
		"1/2 teaspoon grated garlic",
		"1 oregano sprig",
		"1 thyme sprig",
		"1/2 cup dry white wine",
		"1 cup unsalted chicken stock (such as Swanson)",
		"1 teaspoon all-purpose flour",
		"1 tablespoon capers, rinsed and drained",
		"2 tablespoons chopped fresh flat-leaf parsley"
	],
	"preparation": [
		"Combine lemon slices, sugar, and garlic in a medium bowl.",
		"Sprinkle chicken with 3/8 teaspoon salt and pepper. Heat a large skillet over medium-high heat. Add 2 teaspoons oil; swirl to coat. Add chicken to pan; cook 4 minutes on each side or until done. Place chicken on a plate. Add remaining 1 teaspoon oil to pan; swirl to coat. Add lemon mixture to pan; cook 1 minute or until lemon slices are lightly browned, turning occasionally. Return lemon mixture to bowl.",
		"Wipe pan with paper towels. Heat pan over medium heat. Add 1 1/2 teaspoons butter to pan; swirl until butter melts. Add shallot, 1/2 teaspoon grated garlic, oregano sprig, and thyme sprig; cook 1 minute. Add wine to pan, scraping pan to loosen browned bits. Bring to a boil; cook 3 minutes or until liquid almost evaporates. Add remaining 1/8 teaspoon salt, stock, and flour to pan, stirring with a whisk. Bring to a boil; reduce heat, and simmer 3 minutes or until liquid is reduced to about 2/3 cup. Remove pan from heat; discard oregano and thyme sprigs. Stir in remaining 1 1/2 tablespoons butter and capers, stirring until butter melts. Return chicken and any juices to pan; turn to coat with sauce. Top chicken with lemon mixture. Sprinkle with parsley."
	],
	"note": "Lightly charring the lemon slices intensifies their flavor and creates a gorgeous look. Be sure to include any of the sweet, tangy liquid the lemons give off in the bowl; it adds incredible depth to the sauce. ////Calories 332<br>Fat 13.7 g<br>Satfat 5.1 g<br>Monofat 5.5 g<br>Polyfat 1.2 g<br>Protein 38 g<br>Carbohydrate 7 g<br>Fiber 1 g<br>Cholesterol 124 mg<br>Iron 1 mg<br>Sodium 576 mg<br>Calcium 35 mg"
}